Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/FRKE_old/FRKE_old.tmx
Source language: en_us
Languages: de_de

source: 6. The indicator cap (100) of claim 5, wherein the engagement portion (40) and the capping portion (50) are adapted to define a peripherally circumferential lip (52), substantially at the capping portion (50).
de_de: 6. Indikatorkappe (100) nach Anspruch 5, wobei der Eingriffsabschnitt (40) und der Kappenabschnitt (50) angepasst sind, um eine periphere Umfangslippe (52) zu bilden, im Wesentlichen an dem Kappenabschnitt (50).

source: 7. The indicator cap (100) of claim 6, wherein in use, the circumferential lip (52) bears against the open end of the pipe, and the engagement portion (40) is nested and concealed in a cavity of the pipe.
de_de: 7. Indikatorkappe (100) nach Anspruch 6, wobei im Gebrauch die Umfangslippe (52) an dem offenen Ende des Rohrs anliegt und der Eingriffsabschnitt (40) in einem Hohlraum des Rohrs eingebettet und verdeckt ist.

source: 8. The indicator cap (100) of any one of the preceding claims, wherein the engagement portion (40) is snugly, abuttingly, adhesively or threadingly engaged with the pipe.
de_de: 8. Indikatorkappe (100) nach einem der vorhergehenden Ansprüche, wobei der Eingriffsabschnitt (40) eng anliegend, anstoßend, klebend oder gewindemäßig mit dem Rohr in Eingriff ist.

source: 9. The indicator cap (100) of claim 2, wherein the flange (42) is substantially circular and comprises a flange diameter (DF), the flange diameter (DF) being greater than both the pipe engaging diameter (PE) and the pipe capping diameter (PD).
de_de: 9. Indikatorkappe (100) nach Anspruch 2, wobei der Flansch (42) im Wesentlichen kreisförmig ist und einen Flanschdurchmesser (DF) umfasst, wobei der Flanschdurchmesser (DF) größer ist als sowohl der Rohreingriffsdurchmesser (PE) als auch der Rohrkappendurchmesser (PD).

source: The indicator cap (100) of any preceding claim, wherein the flange (42) is comprised of a meshed material.
de_de: Indikatorkappe (100) nach einem der vorhergehenden Ansprüche, wobei der Flansch (42) ein Maschenmaterial umfasst.

source: The indicator cap (100) of any preceding claim, wherein the means for aiding location (10) comprises a projection (11), wherein the projection (11) is comprised of a resilient material and is both deformable so as to not impede screeding thereover, and resilient so as to recover post screeding.
de_de: Indikatorkappe (100) nach einem der vorhergehenden Ansprüche, wobei das Mittel für eine Lokalisierungshilfe (10) einen Vorsprung (11) umfasst, wobei der Vorsprung (11) aus einem rückstellenden Material besteht und sowohl verformbar ist, um das Abziehen darüber nicht zu behindern, als auch rückstellend ist, um sich nach dem Abziehen zurückzustellen.

source: The indicator cap (100) of claim 11, wherein the resilient projection (11) deforms by depressing below the surface (51) of the capping portion (50) so as to not impede screeding thereover, and resilient so as to recover post screeding.
de_de: Indikatorkappe (100) nach Anspruch 11, wobei sich der rückstellende Vorsprung (11) durch Eindrücken unter die Oberfläche (51) des Kappenabschnitts (50) verformt, um das Abziehen darüber nicht zu behindern, und rückstellend ist, um sich nach dem Abziehen zurückzustellen.

source: The indicator cap (100) of any one of the preceding claims, wherein the means for aiding location (10) is manufactured of the resilient material, whereby the means for aiding location (10) assists in removing or preventing a screeded material from settling on the surface (51) of the capping portion (50) of the indicator cap (100).
de_de: Indikatorkappe (100) nach einem der vorhergehenden Ansprüche, wobei das Mittel für eine Lokalisierungshilfe (10) aus dem rückstellenden Material hergestellt ist, wodurch das Mittel für eine Lokalisierungshilfe (10) das Entfernen von abgezogenem Material oder das Verhindern von Absetzen davon auf der Oberfläche (51) des Abdeckabschnitts (50) der Indikatorkappe (100) fördert.

source: A method for screeding cement over and locating a pipe projection (110) by use of the indicator cap (100) as in any one of the preceding claims, the method comprising the steps of: cutting the pipe projection (110) such that an open end (111) of the pipe projection (110) is level with an intended surface of a concrete slab, installing the indicator cap (100) on the pipe projection (110), pouring cement required to form the concrete slab, screeding the cement to form the intended surface of the concrete slab including screeding over the indicator cap (100), allowing time for the concrete slab to cure, then using the means for aiding location (10) to locate the indicator cap (100) and thus the pipe (110), and then cutting the capping portion (50) of the indicator cap (100) using a cutting means to expose the open end of the pipe (110), thereby providing a means for subsequent connection or access to the pipe (110).
de_de: Verfahren zum Abziehen von Zement über einen Rohrvorsprung (110) und zum Lokalisieren desselben anhand der Indikatorkappe (100) nach einem der vorhergehenden Ansprüche, wobei das Verfahren die folgenden Schritte umfasst: Schneiden des Rohrvorsprungs (110) derart, dass ein offenes Ende (111) des Rohrvorsprungs (110) mit einer beabsichtigten Oberfläche einer Betonplatte bündig ist, Anbringen der Indikatorkappe (100) auf dem Rohrvorsprung (110), Gießen von Zement, der erforderlich ist, um die Betonplatte zu bilden, Abziehen des Zements, um die beabsichtigte Oberfläche der Betonplatte zu bilden, einschließlich des Abziehens über die Indikatorkappe (100), Erlauben einer Zeit zum Aushärten der Betonplatte, dann Verwenden des Mittels für eine Lokalisierungshilfe (10), um die Indikatorkappe (100) und somit das Rohr (110) zu lokalisieren, und dann Schneiden des Kappenabschnitts (50) der Indikatorkappe (100) mit einem Schneidmittel, um das offene Ende des Rohrs (110) freizulegen, wodurch ein Mittel für eine nachfolgende Verbindung oder einen Zugang zu dem Rohr (110) bereitgestellt wird.

source: 1. A method of improving communication between a wheel unit sensor and a master controller, the method comprising:
de_de: 1. Verfahren zur Verbesserung der Kommunikation zwischen einem Radeinheitssensor und einem Mastersteuergerät, wobei das Verfahren Folgendes umfasst:

source: determining (402), by the wheel unit sensor (401), whether a receive schedule of the wheel unit sensor (401) indicates that a receive window has started;
de_de: Bestimmen (402) durch den Radeinheitssensor (401), ob ein Empfangszeitplan des Radeinheitssensors (401) angibt, dass ein Empfangsfenster begonnen hat;

source: in response to determining that the receive schedule indicates that the receive window has started, turning-on (404), by the wheel unit sensor (401), for the duration of the receive window, a wireless receiver (403) of the wheel unit sensor (401); the wireless receiver configured to receive messages from the master controller (405)
de_de: als Reaktion auf ein Bestimmen, dass der Empfangszeitplan angibt, dass das Empfangsfenster begonnen hat, Einschalten (404) eines drahtlosen Empfängers (403) des Radeinheitssensors (401) für die Dauer des Empfangsfensters durch den Radeinheitssensor (401); wobei der drahtlose Empfänger konfiguriert ist, um Nachrichten von dem Mastersteuergerät (405) zu empfangen

source: determining (502), by the wheel unit sensor (401), whether the wireless receiver (403) received a message from the master controller (405) during the receive window;
de_de: Bestimmen (502) durch den Radeinheitssensor (401), ob der drahtlose Empfänger (403) während des Empfangsfensters eine Nachricht von dem Mastersteuergerät (405) empfangen hat;

source: in response to determining that the wireless receiver (403) received a message from the master controller (405) during the receive window, determining (602), by the wheel unit sensor (401), whether synchronization data within the message indicates that the receive schedule is in sync with a transmit schedule of the master controller; and
de_de: als Reaktion auf ein Bestimmen, dass der drahtlose Empfänger (403) eine Nachricht von dem Mastersteuergerät (405) während des Empfangsfensters empfangen hat, Bestimmen (602) durch den Radeinheitssensor (401), ob Synchronisationsdaten innerhalb der Nachricht angeben, dass der Empfangszeitplan mit einem Übertragungszeitplan der Mastersteuerung synchron ist; und

source: in response to determining that the synchronization data indicates that the receive schedule is not in sync with the transmit schedule, adjusting (604), by the wheel unit sensor, the receive schedule of the wheel unit sensor.
de_de: in Reaktion auf ein Bestimmen, dass die Synchronisationsdaten angeben, dass der Empfangszeitplan nicht mit dem Übertragungszeitplan synchron ist, Anpassen (604) des Empfangszeitplans des Radeinheitssensors durch den Radeinheitssensor.

source: 2. The method of claim 1 wherein determining (602) whether the synchronization data (650) within the message (550) indicates that the receive schedule (420) is in sync with a transmit schedule (652) of the master controller (405) includes determining (702) whether a message counter value (750) within the synchronization data (650) is outside a predetermined range;
de_de: 2. Verfahren nach Anspruch 1, wobei ein Bestimmen (602), ob die Synchronisationsdaten (650) innerhalb der Nachricht (550) angeben, dass der Empfangszeitplan (420) mit einem Übertragungszeitplan (652) des Mastersteuergeräts (405) synchron ist, Bestimmen (702) einschließt, ob ein Nachrichtenzählerwert (750) innerhalb der Synchronisationsdaten (650) außerhalb eines vorbestimmten Bereichs ist;

source: wherein the message counter value (750) indicates when within the transmit schedule that the master controller (405) transmitted the message (550).
de_de: wobei der Nachrichtenzählerwert (750) angibt, wann innerhalb des Übertragungszeitplans das Mastersteuergerät (405) die Nachricht (550) übertragen hat.

source: 3. The method of claim 1 further comprising:
de_de: 3. Verfahren nach Anspruch 1, ferner umfassend:

source: in response to determining that the wireless receiver (403) did not receive a message (550) from the master controller (405), determining (802), by the wheel unit sensor (401), when was the last time that the wireless receiver (403) received a message (550) from the master controller (405);
de_de: als Reaktion auf ein Bestimmen, dass der drahtlose Empfänger (403) keine Nachricht (550) von dem Mastersteuergerät (405) empfangen hat, Bestimmen (802) durch den Radeinheitssensor (401), wann der drahtlose Empfänger (403) das letzte Mal eine Nachricht (550) von dem Mastersteuergerät (405) empfangen hat;

source: determining (804), by the wheel unit sensor (401), whether the last time that the wireless receiver (403) received a message (550) from the master controller (405) is beyond a predetermined interval (850);
de_de: Bestimmen (804) durch den Radeinheitssensor (401), ob das letzte Mal, dass der drahtlose Empfänger (403) eine Nachricht (550) von dem Mastersteuergerät (405) empfangen hat, über ein vorbestimmtes Intervalls (850) hinausgeht;

source: in response to determining that the last time that the wireless receiver (403) received a message (550) from the master controller (405) is beyond the predetermined interval (850), adding (806), by the wheel unit sensor (401), an extended receive window (852) to the receive schedule (420);
de_de: als Reaktion auf ein Bestimmen, dass das letzte Mal, dass der drahtlose Empfänger (403) eine Nachricht (550) von dem Mastersteuergerät (405) empfangen hat, über das vorbestimmte Intervall (850) hinausgeht, Hinzufügen (806) eines erweiterten Empfangsfensters (852) zu dem Empfangszeitplan (420) durch den Radeinheitssensor (401);

source: determining (808), by the wheel unit sensor (401), whether the receive schedule (420) of the wheel unit sensor (401) indicates that an extended receive window (852) has started; and
de_de: Bestimmen (808) durch den Radeinheitssensor (401), ob der Empfangszeitplan (420) des Radeinheitssensors (401) angibt, dass ein erweitertes Empfangsfenster (852) begonnen wurde; und

source: in response to determining that the receive schedule (420) indicates that the extended receive window (852) has started, turning-on (810), by the wheel unit sensor (401), the wireless receiver (403) for the duration of the extended receive window (852).
de_de: als Reaktion auf ein Bestimmen, dass der Empfangszeitplan (420) angibt, dass das erweiterte Empfangsfenster (852) begonnen hat, Einschalten (810) des drahtlosen Empfängers (403) durch den Radeinheitssensor (401) für die Dauer des erweiterten Empfangsfensters (852).

source: 4. The method of claim 3 further comprising:
de_de: 4. Verfahren nach Anspruch 3, ferner umfassend:

source: determining (812), by the wheel unit sensor (401), whether the wireless receiver (403) received any messages from the master controller (405) during the extended receive window;
de_de: Bestimmen (812) durch den Radeinheitssensor (401), ob der drahtlose Empfänger (403) während des erweiterten Empfangsfensters jegliche Nachrichten von dem Mastersteuergerät (405) empfangen hat;

source: in response to determining that the wireless receiver did not receive any messages from the master controller during the extended receive window, transmitting (814) to the master controller (405), by the wheel unit sensor (401), a message (890) indicating a lack of synchronization between the receive schedule and the transmit schedule; and
de_de: als Reaktion auf ein Bestimmen, dass der drahtlose Empfänger während des erweiterten Empfangsfensters keine Nachrichten von dem Mastersteuergerät empfangen hat, Übertragen (814) einer Nachricht (890), die einen Mangel an Synchronisation zwischen dem Empfangszeitplan und dem Übertragungszeitplan angibt, an das Mastersteuergerät (405) durch den Radeinheitssensor (401); und

source: in response to transmitting the message (890) indicating a lack of synchronization between the receive schedule and the transmit schedule, starting (816) a second extended receive window (891).
de_de: als Reaktion auf ein Übertragen der Nachricht (890), die eine fehlende Synchronisation zwischen dem Empfangszeitplan und dem Übertragungszeitplan angibt, Beginnen (816) eines zweiten erweiterten Empfangsfensters (891).

source: 5. The method of claim 1 further comprising:
de_de: 5. Verfahren nach Anspruch 1, ferner umfassend:

source: receiving (902), by the wheel unit sensor (401), at the wireless receiver (403), a message (950) from the master controller (405).
de_de: Empfangen (902) einer Nachricht (950) von dem Mastersteuergerät (405) durch den Radeinheitssensor (401) an dem drahtlosen Empfänger (403).

source: 6. The method of claim 5 further comprising:
de_de: 6. Verfahren nach Anspruch 5, ferner umfassend:

source: in response to receiving the message (950):
de_de: als Reaktion auf ein Empfangen der Nachricht (950):

source: turning-on (1002), by the wheel unit sensor (401), the wireless transmitter (403) of the wheel unit sensor (401); and
de_de: Einschalten (1002) des drahtlosen Transmitters (403) des Radeinheitssensors (401) durch den Radeinheitssensor (401); und

source: transmitting (1004) to the master controller (405), by the wheel unit sensor (401), monitoring data (1050) collected by the wheel unit sensor (401).
de_de: Übermitteln (1004) von durch den Radeinheitssensor (401) gesammelten Überwachungsdaten (1050) an das Mastersteuergerät (405) durch den Radeinheitssensor (401).

source: 7. The method of claim 5 wherein the message (950) includes a command (1150) from the master controller (405); and
de_de: 7. Verfahren nach Anspruch 5, wobei die Nachricht (950) einen Befehl (1150) von dem Mastersteuergerät (405) einschließt; und

source: the method further comprising in response to receiving the message (950), performing (1102), by the wheel unit sensor (401), the command (1150).
de_de: das Verfahren ferner als Reaktion auf ein Empfangen der Nachricht (950) Durchführen (1102) des Befehls (1150) durch den Radeinheitssensor (401) umfasst.

source: 8. A method of improving communication between a wheel unit sensor and a master controller, the method comprising:
de_de: 8. Verfahren zur Verbesserung der Kommunikation zwischen einem Radeinheitssensor und einem Mastersteuergerät, wobei das Verfahren Folgendes umfasst:

source: determining (1202), by the master controller (1205), whether a transmit schedule (1250) of the master controller (1205) indicates that a transmit window (1250) has started;
de_de: Bestimmen (1202) durch das Mastersteuergerät (1205), ob ein Übertragungszeitplan (1250) des Mastersteuergeräts (1205) angibt, dass ein Übertragungsfenster (1250) begonnen hat;

source: in response to determining that the transmit schedule (1250) indicates that the transmit window (1252) has started, transmitting (1204), by the master controller (1205), a message (1260) to a wireless receiver (1203) of the wheel unit sensor (1201); and
de_de: als Reaktion auf ein Bestimmen, dass der Übertragungszeitplan (1250) angibt, dass das Übertragungsfenster (1252) begonnen hat, Übertragen (1204) einer Nachricht (1260) an einen drahtlosen Empfänger (1203) des Radeinheitssensors (1201) durch das Mastersteuergerät (1205) ; und

source: tracking (1502), by the master controller (1205), the number (1550) of messages transmitted by the master controller (1205) within a predetermined amount of time;
de_de: Verfolgen (1502) der Anzahl (1550) der von dem Mastersteuergerät (1205) innerhalb einer vorbestimmten Zeitspanne übermittelten Nachrichten durch das Mastersteuergerät (1205);

source: wherein the message (1260) includes synchronization data (1590) indicating the number (1550) of messages transmitted by the master controller (1205) within the predetermined amount of time.
de_de: wobei die Nachricht (1260) Synchronisationsdaten (1590) einschließt, die die Anzahl (1550) der von dem Mastersteuergerät (1205) innerhalb der vorbestimmten Zeitspanne übertragenen Nachrichten angeben.

source: 9. The method of claim 8 further comprising:
de_de: 9. Verfahren nach Anspruch 8, ferner umfassend:

source: in response to transmitting the message (1260) to the wireless receiver (1230) of the wheel unit sensor (1201), receiving (1302) from a wireless transmitter (1332) of the wheel unit sensor (1201), by the master controller (1205), monitoring data (1380) collected by the wheel unit sensor (1201).
de_de: als Reaktion auf ein Übertragen der Nachricht (1260) an den drahtlosen Empfänger (1230) des Radeinheitssensors (1201), Empfangen (1302) von durch den Radeinheitssensor (1201) gesammelten Überwachungsdaten (1380), von einem drahtlosen Transmitter (1332) des Radeinheitssensors (1201) durch das Mastersteuergerät (1205).

source: The method of claim 8 wherein the message (1260) transmitted by the master controller (1205) includes a command (1450) for the wheel unit sensor (1201) to perform; and
de_de: Verfahren nach Anspruch 8, wobei die von dem Mastersteuergerät (1205) übertragene Nachricht (1260) einen Befehl (1450) einschließt, den der Radeinheitssensor (1201) durchführen soll; und

source: the method further comprising receiving (1402), by the master controller (1205), data (1450) from the wheel unit (1201) indicating that the wheel unit (1201) performed the command (1450).
de_de: das Verfahren ferner ein Empfangen (1402) durch das Mastersteuergerät (1205) von Daten (1450) von der Radeinheit (1201), die angeben, dass die Radeinheit (1201) den Befehl (1450) durchgeführt hat, umfasst.

source: The method of claim 8 wherein the message (1260) transmitted by the master controller includes synchronization data (1590) for synchronizing the transmit schedule of the master controller (1205) with a receive schedule of the wheel unit sensor.
de_de: Verfahren nach Anspruch 8, wobei die von dem Mastersteuergerät übertragene Nachricht (1260) Synchronisationsdaten (1590) zum Synchronisieren des Übertragungszeitplans des Mastersteuergeräts (1205) mit einem Empfangszeitplan des Radeinheitssensors einschließt.

source: The method of claim 8 further comprising:
de_de: Verfahren nach Anspruch 8, ferner umfassend:

source: receiving (1602) from a wireless transmitter (1203) of the wheel unit sensor (1201), by the master controller (1205), a message (1650) indicating a lack of synchronization between the transmit schedule and a receive schedule of the master controller; and
de_de: Empfangen (1602) einer Nachricht (1650) von einem drahtlosen Transmitter (1203) des Radeinheitssensors (1201) durch das Mastersteuergerät (1205), die einen Mangel an Synchronisation zwischen dem Übertragungszeitplan und einem Empfangszeitplan des Mastersteuergeräts angibt; und

source: in response to receiving the message (1650) indicating a lack of synchronization between the transmit schedule and the receive schedule, transmitting (1604) one or more messages (1660) to the wireless receiver (1203) of the wheel unit sensor (1201).
de_de: als Reaktion auf ein Empfangen der Nachricht (1650), die einen Mangel an Synchronisation zwischen dem Übertragungszeitplan und dem Empfangszeitplan angibt, Übertragen (1604) einer oder mehrerer Nachrichten (1660) an den drahtlosen Empfänger (1203) des Radeinheitssensors (1201).

source: A wheel unit sensor (401) configured for improving communication with a master controller, the wheel unit sensor comprising a controller coupled to memory, the memory including computer program instructions that when executed by the controller cause the controller to:
de_de: Radeinheitssensor (401), der zur Verbesserung der Kommunikation mit einem Mastersteuergerät konfiguriert ist, wobei der Radeinheitssensor ein mit einem Speicher gekoppeltes Steuergerät umfasst, wobei der Speicher Computerprogrammanweisungen einschließt, die, wenn sie von dem Steuergerät ausgeführt werden, das Steuergerät dazu veranlassen:

source: determine (402) whether a receive schedule of the wheel unit sensor (401) indicates that a receive window has started;
de_de: zu bestimmen (402), ob ein Empfangszeitplan des Radeinheitssensors (401) angibt, dass ein Empfangsfenster begonnen hat;

source: in response to determining that the receive schedule indicates that the receive window has started, turn-on (404), for the duration of the receive window (403), a wireless receiver (403) of the wheel unit sensor (401); the wireless receiver configured to receive messages from the master controller (405);
de_de: als Reaktion auf ein Bestimmen, dass der Empfangszeitplan angibt, dass das Empfangsfenster begonnen wurde, einen drahtlosen Empfängers (403) des Radeinheitssensors (401) für die Dauer des Empfangsfensters (403) einzuschalten (404); wobei der drahtlose Empfänger konfiguriert ist, um Nachrichten von dem Mastersteuergerät (405) zu empfangen;

source: determine (502) whether the wireless receiver (403) received a message from the master controller (405) during the receive window;
de_de: zu bestimmen (502), ob der drahtlose Empfänger (403) während des Empfangsfensters eine Nachricht von dem Mastersteuergerät (405) empfangen hat;

source: in response to determining that the wireless receiver (403) received a message from the master controller (405) during the receive window, determine (602) whether synchronization data within the message indicates that the receive schedule is in sync with a transmit schedule of the master controller; and
de_de: als Reaktion auf ein Bestimmen, dass der drahtlose Empfänger (403) eine Nachricht von dem Mastersteuergerät (405) während des Empfangsfensters empfangen hat, zu bestimmen (602), ob Synchronisationsdaten innerhalb der Nachricht angeben, dass der Empfangszeitplan mit einem Übertragungszeitplan der Mastersteuerung synchron ist; und
